Revit 2024 API
EnergyAnalysisConstruction.ThermalResistance Property
 The thermal resistance value (R-value) of the construction.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public double ThermalResistance { get; }
Visual Basic
Public ReadOnly Property ThermalResistance As Double
	Get
Visual C++
public:
property double ThermalResistance {
	double get ();
}
See Also
EnergyAnalysisConstruction Class
Autodesk.Revit.DB.Analysis Namespace